posts/algorithm-basic-sim-search.org
#+TITLE:       算法基础-模拟与搜索
#+DATE:        <2021-01-15 00:00>
#+FILETAGS:    algorithm
#+OPTIONS:     H:3 num:nil toc:nil \n:t ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: 模拟与搜索的算法讲解
* 前言
模拟既直接根据题意做题，搜索既在可能的解里寻找正确答案

下面我就根据几道题目来具体的讲解它们的解题思路
* 扫雷游戏
https://www.luogu.com.cn/problem/P2670
** 思路
题目要求输出每个格子周围的地雷数，那么根据模拟思维，直接统计每个格子周围的地雷数并输出即可
** 代码
#+begin_src C++ :cmdline < demo.in
#include <iostream>

using namespace std;

bool checkb(int x, int y, int n, int m) {
  if (x < 0 || y < 0 || x >= n || y >= m)
    return false;
  return true;
}

int main() {
  int n, m;
  cin >> n >> m;
  char all[n][m];
  // 输入
  for (int i = 0; i < n; i++)
    for (int j = 0; j < m; j++)
      cin >> all[i][j];

  // 遍历每个格子
  for (int i = 0; i < n; i++) {
    for (int j = 0; j < m; j++)
      // 如果不是雷就统计周围地雷数
      if (all[i][j] == '?') {
        int count = 0;
        // 遍历周围八个格子
        for (int x = -1; x <= 1; x++)
          for (int y = -1; y <= 1; y++)
            // 防止越界
            if (checkb(i + x, j + y, n, m) && all[i + x][j + y] == '*')
              count++;
        cout << count;
      } else
        cout << "*";
    cout << endl;
  }
  return 0;
}
#+end_src

#+RESULTS:
| *10 |
| 221 |
| 1*1 |

* 字符串的展开
https://www.luogu.com.cn/problem/P1098
** 思路
这是一道复杂的模拟题目，题目已经把我们要做的操作都描述出来了，我们要学会如何分解这些复杂的操作，因为这么复杂的逻辑很容易写错，而把逻辑分解成一个个模块后再调试显然是更加方便快捷的。
