algorithm-basic-sim-search.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<meta name="description" content="模拟与搜索的算法讲解">
<link rel="alternate"
      type="application/rss+xml"
      href="https://lampze.github.io/rss.xml"
      title="RSS feed for https://lampze.github.io/">
<title>算法基础-模拟与搜索</title>
<meta  name="author" content="lampze" />
      <link href= "static/style.css" rel="stylesheet" type="text/css" />
      <link href= "static/org.css" rel="stylesheet" type="text/css" />
      <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
      <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
        <a href="https://lampze.github.io">lampze's Blog</a>
      </div></div>
<div id="content">
<div class="post-date">2021-01-15</div><h1 class="post-title"><a href="https://lampze.github.io/algorithm-basic-sim-search.html">算法基础-模拟与搜索</a></h1>
<div id="outline-container-org9730ef4" class="outline-2">
<h2 id="org9730ef4">前言</h2>
<div class="outline-text-2" id="text-org9730ef4">
<p>
模拟既直接根据题意做题，搜索既在可能的解里寻找正确答案<br>
</p>

<p>
下面我就根据几道题目来具体的讲解它们的解题思路<br>
</p>
</div>
</div>
<div id="outline-container-org4a6c947" class="outline-2">
<h2 id="org4a6c947">扫雷游戏</h2>
<div class="outline-text-2" id="text-org4a6c947">
<p>
<a href="https://www.luogu.com.cn/problem/P2670">https://www.luogu.com.cn/problem/P2670</a><br>
</p>
</div>
<div id="outline-container-org41582a1" class="outline-3">
<h3 id="org41582a1">思路</h3>
<div class="outline-text-3" id="text-org41582a1">
<p>
题目要求输出每个格子周围的地雷数，那么根据模拟思维，直接统计每个格子周围的地雷数并输出即可<br>
</p>
</div>
</div>
<div id="outline-container-org04ea18c" class="outline-3">
<h3 id="org04ea18c">代码</h3>
<div class="outline-text-3" id="text-org04ea18c">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">bool</span> <span style="font-weight: bold;">checkb</span><span style="color: #014980;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">x</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">y</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">n</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">m</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>x &lt; <span style="color: #8a3b3c; font-weight: bold;">0</span> || y &lt; <span style="color: #8a3b3c; font-weight: bold;">0</span> || x &gt;= n || y &gt;= m<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> <span style="color: #383a42;">false</span>;
  <span style="font-weight: bold;">return</span> <span style="color: #383a42;">true</span>;
<span style="color: #014980;">}</span>

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">n</span>, <span style="color: #383a42;">m</span>;
  cin &gt;&gt; n &gt;&gt; m;
  <span style="font-weight: bold;">char</span> <span style="color: #383a42;">all</span><span style="color: #a626a4;">[</span>n<span style="color: #a626a4;">][</span>m<span style="color: #a626a4;">]</span>;
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36755;&#20837;</span>
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; n; i++<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">j</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; j &lt; m; j++<span style="color: #a626a4;">)</span>
      cin &gt;&gt; all<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">][</span>j<span style="color: #a626a4;">]</span>;

  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36941;&#21382;&#27599;&#20010;&#26684;&#23376;</span>
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; n; i++<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">for</span> <span style="color: #556b2f;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">j</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; j &lt; m; j++<span style="color: #556b2f;">)</span>
      <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#22914;&#26524;&#19981;&#26159;&#38647;&#23601;&#32479;&#35745;&#21608;&#22260;&#22320;&#38647;&#25968;</span>
      <span style="font-weight: bold;">if</span> <span style="color: #556b2f;">(</span>all<span style="color: #b751b6;">[</span>i<span style="color: #b751b6;">][</span>j<span style="color: #b751b6;">]</span> == <span style="color: #8a3b3c;">'?'</span><span style="color: #556b2f;">)</span> <span style="color: #556b2f;">{</span>
        <span style="font-weight: bold;">int</span> <span style="color: #383a42;">count</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
        <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36941;&#21382;&#21608;&#22260;&#20843;&#20010;&#26684;&#23376;</span>
        <span style="font-weight: bold;">for</span> <span style="color: #b751b6;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">x</span> = -<span style="color: #8a3b3c; font-weight: bold;">1</span>; x &lt;= <span style="color: #8a3b3c; font-weight: bold;">1</span>; x++<span style="color: #b751b6;">)</span>
          <span style="font-weight: bold;">for</span> <span style="color: #b751b6;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">y</span> = -<span style="color: #8a3b3c; font-weight: bold;">1</span>; y &lt;= <span style="color: #8a3b3c; font-weight: bold;">1</span>; y++<span style="color: #b751b6;">)</span>
            <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#38450;&#27490;&#36234;&#30028;</span>
            <span style="font-weight: bold;">if</span> <span style="color: #b751b6;">(</span>checkb<span style="color: #014980;">(</span>i + x, j + y, n, m<span style="color: #014980;">)</span> &amp;&amp; all<span style="color: #014980;">[</span>i + x<span style="color: #014980;">][</span>j + y<span style="color: #014980;">]</span> == <span style="color: #8a3b3c;">'*'</span><span style="color: #b751b6;">)</span>
              count++;
        cout &lt;&lt; count;
      <span style="color: #556b2f;">}</span> <span style="font-weight: bold;">else</span>
        cout &lt;&lt; <span style="color: #8a3b3c;">"*"</span>;
    cout &lt;&lt; endl;
  <span style="color: #a626a4;">}</span>
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga25590a" class="outline-2">
<h2 id="orga25590a">字符串的展开</h2>
<div class="outline-text-2" id="text-orga25590a">
<p>
<a href="https://www.luogu.com.cn/problem/P1098">https://www.luogu.com.cn/problem/P1098</a><br>
</p>
</div>
<div id="outline-container-orgf880a82" class="outline-3">
<h3 id="orgf880a82">思路</h3>
<div class="outline-text-3" id="text-orgf880a82">
<p>
这是一道复杂的模拟题目，题目已经把我们要做的操作都描述出来了，我们要学会如何分解这些复杂的操作，因为这么复杂的逻辑很容易写错，而把逻辑分解成一个个模块后再调试显然是更加方便快捷的。<br>
</p>
</div>
</div>
