posts/algorithm-basic-sim-search.org
** 代码
#+begin_src C++ :cmdline < demo.in
#include <algorithm>
#include <iostream>
#include <string>

using namespace std;

int p1, p2, p3;

bool isnum(char c) { return c >= '0' && c <= '9'; }

char tobig(char c) {
  if (c >= 'a' && c <= 'z')
    return c - 'a' + 'A';
  return c;
}

char tosmall(char c) {
  if (c >= 'A' && c <= 'Z')
    return c + 'a' - 'A';
  return c;
}

// 因为有各种参数，所以使用这个函数获取真实字符
char realchar(char c) {
  if (p1 == 3)
    return '*';
  if (isnum(c))
    return c;
  if (p1 == 2)
    return tobig(c);
  if (p1 == 1)
    return tosmall(c);
  return c;
}

// 返回不包括a，b的扩展字符串
string re(char a, char b) {
  // 中间没有可扩展的字符返回空
  if (b - a == 1)
    return "";
  // a大于b，不能扩展
  if (a >= b)
    return "-";
  // 两个字符类型不同
  if (isnum(a) != isnum(b))
    return "-";
  // 都是-肯定不行
  if (a == '-' || b == '-')
    return "-";
  string out = "";
  char c = a + 1;
  for (char c = a + 1; c < b; c++)
    for (int i = 0; i < p2; i++)
      out += realchar(c);
  if (p3 == 2)
    reverse(out.begin(), out.end());
  return out;
}

int main() {
  string s;
  cin >> p1 >> p2 >> p3 >> s;
  for (long long i = 0; i < s.size(); i++)
    // 第一个字符可能是-
    if (i && s[i] == '-')
      // 使用re获取扩展的字符串
      cout << re(s[i - 1], s[i + 1]);
    else
      cout << s[i];
  return 0;
}
#+end_src

#+RESULTS:
: abcsttuuvvw1234556677889s-4zz

* 选数
https://www.luogu.com.cn/problem/P1036
** 思路
首先题目提到了素数，那么第一步就是先把素数都筛出来，方便后续操作

然后我们需要需要在 $n$ 个整数里选出 $k$ 个整数相加，很显然这是一个排列问题，那么我们可以使用 =stl= 自带的 =next_permutation= 对 $n$ 个整数进行全排列，然后截取前 $k$ 个整数，当然还需要去重。
或者我们自己使用搜索的思维来写，题目的解空间是所有的排列，每个数字有两种状态，选或不选，选中的数字有个数要求，因为必须要把所有情况过一遍，所以使用 =dfs= 即可。
