algorithm-basic-sim-search.html
<div id="outline-container-orgf11fd0d" class="outline-3">
<h3 id="orgf11fd0d">代码</h3>
<div class="outline-text-3" id="text-orgf11fd0d">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">algorithm</span><span style="color: #014980;">&gt;</span>
<span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>
<span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">string</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">int</span> <span style="color: #383a42;">p1</span>, <span style="color: #383a42;">p2</span>, <span style="color: #383a42;">p3</span>;

<span style="font-weight: bold;">bool</span> <span style="font-weight: bold;">isnum</span><span style="color: #014980;">(</span><span style="font-weight: bold;">char</span> <span style="color: #383a42;">c</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span> <span style="font-weight: bold;">return</span> c &gt;= <span style="color: #8a3b3c;">'0'</span> &amp;&amp; c &lt;= <span style="color: #8a3b3c;">'9'</span>; <span style="color: #014980;">}</span>

<span style="font-weight: bold;">char</span> <span style="font-weight: bold;">tobig</span><span style="color: #014980;">(</span><span style="font-weight: bold;">char</span> <span style="color: #383a42;">c</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>c &gt;= <span style="color: #8a3b3c;">'a'</span> &amp;&amp; c &lt;= <span style="color: #8a3b3c;">'z'</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> c - <span style="color: #8a3b3c;">'a'</span> + <span style="color: #8a3b3c;">'A'</span>;
  <span style="font-weight: bold;">return</span> c;
<span style="color: #014980;">}</span>

<span style="font-weight: bold;">char</span> <span style="font-weight: bold;">tosmall</span><span style="color: #014980;">(</span><span style="font-weight: bold;">char</span> <span style="color: #383a42;">c</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>c &gt;= <span style="color: #8a3b3c;">'A'</span> &amp;&amp; c &lt;= <span style="color: #8a3b3c;">'Z'</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> c + <span style="color: #8a3b3c;">'a'</span> - <span style="color: #8a3b3c;">'A'</span>;
  <span style="font-weight: bold;">return</span> c;
<span style="color: #014980;">}</span>

<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#22240;&#20026;&#26377;&#21508;&#31181;&#21442;&#25968;&#65292;&#25152;&#20197;&#20351;&#29992;&#36825;&#20010;&#20989;&#25968;&#33719;&#21462;&#30495;&#23454;&#23383;&#31526;</span>
<span style="font-weight: bold;">char</span> <span style="font-weight: bold;">realchar</span><span style="color: #014980;">(</span><span style="font-weight: bold;">char</span> <span style="color: #383a42;">c</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>p1 == <span style="color: #8a3b3c; font-weight: bold;">3</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c;">'*'</span>;
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>isnum<span style="color: #556b2f;">(</span>c<span style="color: #556b2f;">)</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> c;
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>p1 == <span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> tobig<span style="color: #a626a4;">(</span>c<span style="color: #a626a4;">)</span>;
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>p1 == <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> tosmall<span style="color: #a626a4;">(</span>c<span style="color: #a626a4;">)</span>;
  <span style="font-weight: bold;">return</span> c;
<span style="color: #014980;">}</span>

<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36820;&#22238;&#19981;&#21253;&#25324;a&#65292;b&#30340;&#25193;&#23637;&#23383;&#31526;&#20018;</span>
<span style="font-weight: bold;">string</span> <span style="font-weight: bold;">re</span><span style="color: #014980;">(</span><span style="font-weight: bold;">char</span> <span style="color: #383a42;">a</span>, <span style="font-weight: bold;">char</span> <span style="color: #383a42;">b</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#20013;&#38388;&#27809;&#26377;&#21487;&#25193;&#23637;&#30340;&#23383;&#31526;&#36820;&#22238;&#31354;</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>b - a == <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c;">""</span>;
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">a&#22823;&#20110;b&#65292;&#19981;&#33021;&#25193;&#23637;</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>a &gt;= b<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c;">"-"</span>;
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#20004;&#20010;&#23383;&#31526;&#31867;&#22411;&#19981;&#21516;</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>isnum<span style="color: #556b2f;">(</span>a<span style="color: #556b2f;">)</span> != isnum<span style="color: #556b2f;">(</span>b<span style="color: #556b2f;">)</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c;">"-"</span>;
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#37117;&#26159;-&#32943;&#23450;&#19981;&#34892;</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>a == <span style="color: #8a3b3c;">'-'</span> || b == <span style="color: #8a3b3c;">'-'</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c;">"-"</span>;
  <span style="font-weight: bold;">string</span> <span style="color: #383a42;">out</span> = <span style="color: #8a3b3c;">""</span>;
  <span style="font-weight: bold;">char</span> <span style="color: #383a42;">c</span> = a + <span style="color: #8a3b3c; font-weight: bold;">1</span>;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">char</span> <span style="color: #383a42;">c</span> = a + <span style="color: #8a3b3c; font-weight: bold;">1</span>; c &lt; b; c++<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; p2; i++<span style="color: #a626a4;">)</span>
      out += realchar<span style="color: #a626a4;">(</span>c<span style="color: #a626a4;">)</span>;
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>p3 == <span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #a626a4;">)</span>
    reverse<span style="color: #a626a4;">(</span>out.begin<span style="color: #556b2f;">()</span>, out.end<span style="color: #556b2f;">()</span><span style="color: #a626a4;">)</span>;
  <span style="font-weight: bold;">return</span> out;
<span style="color: #014980;">}</span>

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">string</span> <span style="color: #383a42;">s</span>;
  cin &gt;&gt; p1 &gt;&gt; p2 &gt;&gt; p3 &gt;&gt; s;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">long</span> <span style="font-weight: bold;">long</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; s.size<span style="color: #556b2f;">()</span>; i++<span style="color: #a626a4;">)</span>
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#31532;&#19968;&#20010;&#23383;&#31526;&#21487;&#33021;&#26159;-</span>
    <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>i &amp;&amp; s<span style="color: #556b2f;">[</span>i<span style="color: #556b2f;">]</span> == <span style="color: #8a3b3c;">'-'</span><span style="color: #a626a4;">)</span>
      <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#20351;&#29992;re&#33719;&#21462;&#25193;&#23637;&#30340;&#23383;&#31526;&#20018;</span>
      cout &lt;&lt; re<span style="color: #a626a4;">(</span>s<span style="color: #556b2f;">[</span>i - <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">]</span>, s<span style="color: #556b2f;">[</span>i + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">]</span><span style="color: #a626a4;">)</span>;
    <span style="font-weight: bold;">else</span>
      cout &lt;&lt; s<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">]</span>;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org89bd1b5" class="outline-2">
<h2 id="org89bd1b5">选数</h2>
<div class="outline-text-2" id="text-org89bd1b5">
<p>
<a href="https://www.luogu.com.cn/problem/P1036">https://www.luogu.com.cn/problem/P1036</a><br>
</p>
</div>
<div id="outline-container-org8fd7807" class="outline-3">
<h3 id="org8fd7807">思路</h3>
<div class="outline-text-3" id="text-org8fd7807">
<p>
首先题目提到了素数，那么第一步就是先把素数都筛出来，方便后续操作<br>
</p>

<p>
然后我们需要需要在 \(n\) 个整数里选出 \(k\) 个整数相加，很显然这是一个排列问题，那么我们可以使用 <code>stl</code> 自带的 <code>next_permutation</code> 对 \(n\) 个整数进行全排列，然后截取前 \(k\) 个整数，当然还需要去重。<br>
或者我们自己使用搜索的思维来写，题目的解空间是所有的排列，每个数字有两种状态，选或不选，选中的数字有个数要求，因为必须要把所有情况过一遍，所以使用 <code>dfs</code> 即可。<br>
</p>
</div>
</div>
