posts/algorithm-basic-sim-search.org
** 代码
#+begin_src C++ :cmdline < demo.in
#include <algorithm>
#include <iostream>

using namespace std;

long all[21], cou = 0;
int n, k;

bool prime[5000001];

// 三个参数为别为当前位置，选中的数字，当前的和
void dfs(int now, int sel, int sum) {
  // 如果剩下的数不够选就退出
  if (n - now < k - sel)
    return;
  // 选够了数
  if (sel == k) {
    if (!prime[sum])
      cou++;
    return;
  }
  // 遍历每种可能
  for (int i = now; i < n; i++)
    dfs(i + 1, sel + 1, sum + all[i]);
}

int main() {
  for (long i = 2; i < 5000001; i++)
    if (!prime[i])
      for (long j = i * 2; j < 5000001; j += i)
        prime[j] = true;
  prime[0] = prime[1] = true;

  cin >> n >> k;
  for (int i = 0; i < n; i++)
    cin >> all[i];

  dfs(0, 0, 0);

  cout << cou << endl;
  return 0;
}
#+end_src

#+RESULTS:
: 1

* 自然数的拆分问题
https://www.luogu.com.cn/problem/P2404
** 思路
这题就不使用全排列了，只能老老实实的自己写搜索了，因为必须要把所有情况过一遍，所以使用 =dfs= 比较方便，状态只需要保存已分拆分的数字个数与剩余数字就行了。
** 代码
#+begin_src C++ :cmdline < demo.in
#include <iostream>

using namespace std;

int n, all[10];

// 已拆出的数字个数，剩余的数字
void dfs(int now, int last) {
  // 没有剩余的数字了就结束
  if (last == 0) {
    // 1表示还是原来的数字，肯定不能算
    if (now == 1)
      return;
    // 输出拆分的数字
    for (int i = 0; i < now; i++)
      if (i)
        cout << "+" << all[i];
      else
        cout << all[i];
    cout << endl;
    return;
  }
  // 遍历每个可能拆分的数字
  for (int i = 1; i <= last; i++)
    // 因为需要从小到大排序
    // 所以只需要保持比上一个数字大即可
    // 第一个数字当然不用比较了
    if (!now || i >= all[now - 1]) {
      all[now] = i;
      dfs(now + 1, last - i);
    }
}

int main() {
  cin >> n;
  dfs(0, n);
  return 0;
}
#+end_src

#+RESULTS:
| 1+1+1+1+1+1+1 |
|   1+1+1+1+1+2 |
|     1+1+1+1+3 |
|     1+1+1+2+2 |
|       1+1+1+4 |
|       1+1+2+3 |
|         1+1+5 |
|       1+2+2+2 |
|         1+2+4 |
|         1+3+3 |
|           1+6 |
|         2+2+3 |
|           2+5 |
|           3+4 |

* 马的遍历
https://www.luogu.com.cn/problem/P1443
** 思路
题目叫我们计算到达一个点需要多少步，那我们就模拟一只马走路即可，但一只马一步可能走好多个地方，使用循环是不能做出来的，我们必须把马的状态保存起来，每走一次更新一下。
使用队列保存马每一步的坐标与步数，每次取出一个步数最小的状态，把下一步可能的状态计算出并加入到队列就行了。
