algorithm-basic-sim-search.html
<div id="outline-container-orgaf37e24" class="outline-3">
<h3 id="orgaf37e24">代码</h3>
<div class="outline-text-3" id="text-orgaf37e24">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">algorithm</span><span style="color: #014980;">&gt;</span>
<span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">long</span> <span style="color: #383a42;">all</span><span style="color: #014980;">[</span><span style="color: #8a3b3c; font-weight: bold;">21</span><span style="color: #014980;">]</span>, <span style="color: #383a42;">cou</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="font-weight: bold;">int</span> <span style="color: #383a42;">n</span>, <span style="color: #383a42;">k</span>;

<span style="font-weight: bold;">bool</span> <span style="color: #383a42;">prime</span><span style="color: #014980;">[</span><span style="color: #8a3b3c; font-weight: bold;">5000001</span><span style="color: #014980;">]</span>;

<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#19977;&#20010;&#21442;&#25968;&#20026;&#21035;&#20026;&#24403;&#21069;&#20301;&#32622;&#65292;&#36873;&#20013;&#30340;&#25968;&#23383;&#65292;&#24403;&#21069;&#30340;&#21644;</span>
<span style="font-weight: bold;">void</span> <span style="font-weight: bold;">dfs</span><span style="color: #014980;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">now</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">sel</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">sum</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#22914;&#26524;&#21097;&#19979;&#30340;&#25968;&#19981;&#22815;&#36873;&#23601;&#36864;&#20986;</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>n - now &lt; k - sel<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span>;
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36873;&#22815;&#20102;&#25968;</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>sel == k<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">if</span> <span style="color: #556b2f;">(</span><span style="color: #383a42; font-weight: bold;">!</span>prime<span style="color: #b751b6;">[</span>sum<span style="color: #b751b6;">]</span><span style="color: #556b2f;">)</span>
      cou++;
    <span style="font-weight: bold;">return</span>;
  <span style="color: #a626a4;">}</span>
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36941;&#21382;&#27599;&#31181;&#21487;&#33021;</span>
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = now; i &lt; n; i++<span style="color: #a626a4;">)</span>
    dfs<span style="color: #a626a4;">(</span>i + <span style="color: #8a3b3c; font-weight: bold;">1</span>, sel + <span style="color: #8a3b3c; font-weight: bold;">1</span>, sum + all<span style="color: #556b2f;">[</span>i<span style="color: #556b2f;">]</span><span style="color: #a626a4;">)</span>;
<span style="color: #014980;">}</span>

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">long</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">2</span>; i &lt; <span style="color: #8a3b3c; font-weight: bold;">5000001</span>; i++<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span><span style="color: #383a42; font-weight: bold;">!</span>prime<span style="color: #556b2f;">[</span>i<span style="color: #556b2f;">]</span><span style="color: #a626a4;">)</span>
      <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">long</span> <span style="color: #383a42;">j</span> = i * <span style="color: #8a3b3c; font-weight: bold;">2</span>; j &lt; <span style="color: #8a3b3c; font-weight: bold;">5000001</span>; j += i<span style="color: #a626a4;">)</span>
        prime<span style="color: #a626a4;">[</span>j<span style="color: #a626a4;">]</span> = <span style="color: #383a42;">true</span>;
  prime<span style="color: #a626a4;">[</span><span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #a626a4;">]</span> = prime<span style="color: #a626a4;">[</span><span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">]</span> = <span style="color: #383a42;">true</span>;

  cin &gt;&gt; n &gt;&gt; k;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; n; i++<span style="color: #a626a4;">)</span>
    cin &gt;&gt; all<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">]</span>;

  dfs<span style="color: #a626a4;">(</span><span style="color: #8a3b3c; font-weight: bold;">0</span>, <span style="color: #8a3b3c; font-weight: bold;">0</span>, <span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #a626a4;">)</span>;

  cout &lt;&lt; cou &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge5ee173" class="outline-2">
<h2 id="orge5ee173">自然数的拆分问题</h2>
<div class="outline-text-2" id="text-orge5ee173">
<p>
<a href="https://www.luogu.com.cn/problem/P2404">https://www.luogu.com.cn/problem/P2404</a><br>
</p>
</div>
<div id="outline-container-org1a5cb60" class="outline-3">
<h3 id="org1a5cb60">思路</h3>
<div class="outline-text-3" id="text-org1a5cb60">
<p>
这题就不使用全排列了，只能老老实实的自己写搜索了，因为必须要把所有情况过一遍，所以使用 <code>dfs</code> 比较方便，状态只需要保存已分拆分的数字个数与剩余数字就行了。<br>
</p>
</div>
</div>
<div id="outline-container-org4cc0fbd" class="outline-3">
<h3 id="org4cc0fbd">代码</h3>
<div class="outline-text-3" id="text-org4cc0fbd">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">int</span> <span style="color: #383a42;">n</span>, <span style="color: #383a42;">all</span><span style="color: #014980;">[</span><span style="color: #8a3b3c; font-weight: bold;">10</span><span style="color: #014980;">]</span>;

<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#24050;&#25286;&#20986;&#30340;&#25968;&#23383;&#20010;&#25968;&#65292;&#21097;&#20313;&#30340;&#25968;&#23383;</span>
<span style="font-weight: bold;">void</span> <span style="font-weight: bold;">dfs</span><span style="color: #014980;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">now</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">last</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#27809;&#26377;&#21097;&#20313;&#30340;&#25968;&#23383;&#20102;&#23601;&#32467;&#26463;</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>last == <span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">1&#34920;&#31034;&#36824;&#26159;&#21407;&#26469;&#30340;&#25968;&#23383;&#65292;&#32943;&#23450;&#19981;&#33021;&#31639;</span>
    <span style="font-weight: bold;">if</span> <span style="color: #556b2f;">(</span>now == <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">)</span>
      <span style="font-weight: bold;">return</span>;
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36755;&#20986;&#25286;&#20998;&#30340;&#25968;&#23383;</span>
    <span style="font-weight: bold;">for</span> <span style="color: #556b2f;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; now; i++<span style="color: #556b2f;">)</span>
      <span style="font-weight: bold;">if</span> <span style="color: #556b2f;">(</span>i<span style="color: #556b2f;">)</span>
        cout &lt;&lt; <span style="color: #8a3b3c;">"+"</span> &lt;&lt; all<span style="color: #556b2f;">[</span>i<span style="color: #556b2f;">]</span>;
      <span style="font-weight: bold;">else</span>
        cout &lt;&lt; all<span style="color: #556b2f;">[</span>i<span style="color: #556b2f;">]</span>;
    cout &lt;&lt; endl;
    <span style="font-weight: bold;">return</span>;
  <span style="color: #a626a4;">}</span>
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36941;&#21382;&#27599;&#20010;&#21487;&#33021;&#25286;&#20998;&#30340;&#25968;&#23383;</span>
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; i &lt;= last; i++<span style="color: #a626a4;">)</span>
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#22240;&#20026;&#38656;&#35201;&#20174;&#23567;&#21040;&#22823;&#25490;&#24207;</span>
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#25152;&#20197;&#21482;&#38656;&#35201;&#20445;&#25345;&#27604;&#19978;&#19968;&#20010;&#25968;&#23383;&#22823;&#21363;&#21487;</span>
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#31532;&#19968;&#20010;&#25968;&#23383;&#24403;&#28982;&#19981;&#29992;&#27604;&#36739;&#20102;</span>
    <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span><span style="color: #383a42; font-weight: bold;">!</span>now || i &gt;= all<span style="color: #556b2f;">[</span>now - <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">]</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
      all<span style="color: #556b2f;">[</span>now<span style="color: #556b2f;">]</span> = i;
      dfs<span style="color: #556b2f;">(</span>now + <span style="color: #8a3b3c; font-weight: bold;">1</span>, last - i<span style="color: #556b2f;">)</span>;
    <span style="color: #a626a4;">}</span>
<span style="color: #014980;">}</span>

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  cin &gt;&gt; n;
  dfs<span style="color: #a626a4;">(</span><span style="color: #8a3b3c; font-weight: bold;">0</span>, n<span style="color: #a626a4;">)</span>;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc3189c5" class="outline-2">
<h2 id="orgc3189c5">马的遍历</h2>
<div class="outline-text-2" id="text-orgc3189c5">
<p>
<a href="https://www.luogu.com.cn/problem/P1443">https://www.luogu.com.cn/problem/P1443</a><br>
</p>
</div>
<div id="outline-container-org31fd966" class="outline-3">
<h3 id="org31fd966">思路</h3>
<div class="outline-text-3" id="text-org31fd966">
<p>
题目叫我们计算到达一个点需要多少步，那我们就模拟一只马走路即可，但一只马一步可能走好多个地方，使用循环是不能做出来的，我们必须把马的状态保存起来，每走一次更新一下。<br>
使用队列保存马每一步的坐标与步数，每次取出一个步数最小的状态，把下一步可能的状态计算出并加入到队列就行了。<br>
</p>
</div>
</div>
