posts/algorithm-basic-sim-search.org
** 代码
#+begin_src C++ :cmdline < demo.in
#include <cstdio>
#include <iostream>
#include <map>
#include <queue>

using namespace std;

// 使用结构体保存马的状态
struct Horse {
  int x;
  int y;
  int time;
  Horse(int a, int b, int c) {
    x = a;
    y = b;
    time = c;
  }
};

// 记录马下一步可以走的方向
int nex[8][2] = {2, 1, -2, 1, -2, -1, 2, -1, 1, 2, 1, -2, -1, -2, -1, 2};

int main() {
  int n, m, x, y;
  cin >> n >> m >> x >> y;
  int board[n + 1][m + 1];
  bool iswalk[n + 1][m + 1];

  // 先全放上-1，到达不了的点自然就是-1了
  for (int i = 0; i <= n; i++)
    for (int j = 0; j <= m; j++)
      board[i][j] = -1, iswalk[i][j] = false;

  // 放入初始条件
  queue<Horse> q;
  q.push(Horse(x, y, 0));
  iswalk[x][y] = true;

  // 循环到队列为空
  while (!q.empty()) {
    // 取出队首元素
    Horse in = q.front();
    q.pop();
    // 更新当前最小步数
    board[in.x][in.y] = in.time;

    for (int i = 0; i < 8; i++) {
      int nx = in.x + nex[i][0], ny = in.y + nex[i][1];
      // 超出边界或者已经走过就看下一种情况
      if (nx < 1 || ny < 1 || nx > n || ny > m || iswalk[nx][ny])
        continue;
      q.push(Horse(nx, ny, in.time + 1));
      iswalk[nx][ny] = true;
    }
  }

  for (int i = 1; i <= n; i++) {
    for (int j = 1; j <= m; j++)
      printf("%-5d", board[i][j]);
    printf("\n");
  }
  return 0;
}
#+end_src

#+RESULTS:
| 0 |  3 | 2 |
| 3 | -1 | 1 |
| 2 |  1 | 4 |

* 奇怪的电梯
https://www.luogu.com.cn/problem/P1135
** 思路
根据题意，一个楼层最多只能跳转到另外两个楼层，一个节点表示一个楼层，画成图就是一个节点连接着两个节点，可以自己尝试的在纸上画一下。

那么题目的意思就是在这一张图上找到起点到终点的最短距离，使用 =bfs= 即可。
