algorithm-basic-sim-search.html
<div id="outline-container-org878df86" class="outline-3">
<h3 id="org878df86">代码</h3>
<div class="outline-text-3" id="text-org878df86">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">cstdio</span><span style="color: #014980;">&gt;</span>
<span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>
<span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">map</span><span style="color: #014980;">&gt;</span>
<span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">queue</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#20351;&#29992;&#32467;&#26500;&#20307;&#20445;&#23384;&#39532;&#30340;&#29366;&#24577;</span>
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold;">Horse</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">x</span>;
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">y</span>;
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">time</span>;
  <span style="font-weight: bold;">Horse</span><span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">a</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">b</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">c</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    x = a;
    y = b;
    time = c;
  <span style="color: #a626a4;">}</span>
<span style="color: #014980;">}</span>;

<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#35760;&#24405;&#39532;&#19979;&#19968;&#27493;&#21487;&#20197;&#36208;&#30340;&#26041;&#21521;</span>
<span style="font-weight: bold;">int</span> <span style="color: #383a42;">nex</span><span style="color: #014980;">[</span><span style="color: #8a3b3c; font-weight: bold;">8</span><span style="color: #014980;">][</span><span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #014980;">]</span> = <span style="color: #014980;">{</span><span style="color: #8a3b3c; font-weight: bold;">2</span>, <span style="color: #8a3b3c; font-weight: bold;">1</span>, -<span style="color: #8a3b3c; font-weight: bold;">2</span>, <span style="color: #8a3b3c; font-weight: bold;">1</span>, -<span style="color: #8a3b3c; font-weight: bold;">2</span>, -<span style="color: #8a3b3c; font-weight: bold;">1</span>, <span style="color: #8a3b3c; font-weight: bold;">2</span>, -<span style="color: #8a3b3c; font-weight: bold;">1</span>, <span style="color: #8a3b3c; font-weight: bold;">1</span>, <span style="color: #8a3b3c; font-weight: bold;">2</span>, <span style="color: #8a3b3c; font-weight: bold;">1</span>, -<span style="color: #8a3b3c; font-weight: bold;">2</span>, -<span style="color: #8a3b3c; font-weight: bold;">1</span>, -<span style="color: #8a3b3c; font-weight: bold;">2</span>, -<span style="color: #8a3b3c; font-weight: bold;">1</span>, <span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #014980;">}</span>;

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">n</span>, <span style="color: #383a42;">m</span>, <span style="color: #383a42;">x</span>, <span style="color: #383a42;">y</span>;
  cin &gt;&gt; n &gt;&gt; m &gt;&gt; x &gt;&gt; y;
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">board</span><span style="color: #a626a4;">[</span>n + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">][</span>m + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">]</span>;
  <span style="font-weight: bold;">bool</span> <span style="color: #383a42;">iswalk</span><span style="color: #a626a4;">[</span>n + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">][</span>m + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">]</span>;

  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#20808;&#20840;&#25918;&#19978;-1&#65292;&#21040;&#36798;&#19981;&#20102;&#30340;&#28857;&#33258;&#28982;&#23601;&#26159;-1&#20102;</span>
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt;= n; i++<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">j</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; j &lt;= m; j++<span style="color: #a626a4;">)</span>
      board<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">][</span>j<span style="color: #a626a4;">]</span> = -<span style="color: #8a3b3c; font-weight: bold;">1</span>, iswalk<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">][</span>j<span style="color: #a626a4;">]</span> = <span style="color: #383a42;">false</span>;

  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#25918;&#20837;&#21021;&#22987;&#26465;&#20214;</span>
  <span style="font-weight: bold;">queue</span><span style="color: #a626a4;">&lt;</span><span style="font-weight: bold;">Horse</span><span style="color: #a626a4;">&gt;</span> <span style="color: #383a42;">q</span>;
  q.push<span style="color: #a626a4;">(</span>Horse<span style="color: #556b2f;">(</span>x, y, <span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #556b2f;">)</span><span style="color: #a626a4;">)</span>;
  iswalk<span style="color: #a626a4;">[</span>x<span style="color: #a626a4;">][</span>y<span style="color: #a626a4;">]</span> = <span style="color: #383a42;">true</span>;

  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#24490;&#29615;&#21040;&#38431;&#21015;&#20026;&#31354;</span>
  <span style="font-weight: bold;">while</span> <span style="color: #a626a4;">(</span><span style="color: #383a42; font-weight: bold;">!</span>q.empty<span style="color: #556b2f;">()</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#21462;&#20986;&#38431;&#39318;&#20803;&#32032;</span>
    <span style="font-weight: bold;">Horse</span> <span style="color: #383a42;">in</span> = q.front<span style="color: #556b2f;">()</span>;
    q.pop<span style="color: #556b2f;">()</span>;
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#26356;&#26032;&#24403;&#21069;&#26368;&#23567;&#27493;&#25968;</span>
    board<span style="color: #556b2f;">[</span>in.x<span style="color: #556b2f;">][</span>in.y<span style="color: #556b2f;">]</span> = in.time;

    <span style="font-weight: bold;">for</span> <span style="color: #556b2f;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; <span style="color: #8a3b3c; font-weight: bold;">8</span>; i++<span style="color: #556b2f;">)</span> <span style="color: #556b2f;">{</span>
      <span style="font-weight: bold;">int</span> <span style="color: #383a42;">nx</span> = in.x + nex<span style="color: #b751b6;">[</span>i<span style="color: #b751b6;">][</span><span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #b751b6;">]</span>, <span style="color: #383a42;">ny</span> = in.y + nex<span style="color: #b751b6;">[</span>i<span style="color: #b751b6;">][</span><span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #b751b6;">]</span>;
      <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36229;&#20986;&#36793;&#30028;&#25110;&#32773;&#24050;&#32463;&#36208;&#36807;&#23601;&#30475;&#19979;&#19968;&#31181;&#24773;&#20917;</span>
      <span style="font-weight: bold;">if</span> <span style="color: #b751b6;">(</span><span style="font-weight: bold;">nx</span> <span style="color: #014980;">&lt;</span> <span style="color: #8a3b3c; font-weight: bold;">1</span> || <span style="font-weight: bold;">ny</span> <span style="color: #a626a4;">&lt;</span> <span style="color: #8a3b3c; font-weight: bold;">1</span> || nx <span style="color: #a626a4;">&gt;</span> n || ny <span style="color: #014980;">&gt;</span> <span style="color: #383a42;">m</span> || iswalk<span style="color: #014980;">[</span>nx<span style="color: #014980;">][</span>ny<span style="color: #014980;">]</span><span style="color: #b751b6;">)</span>
        <span style="font-weight: bold;">continue</span>;
      q.push<span style="color: #b751b6;">(</span>Horse<span style="color: #014980;">(</span>nx, ny, in.time + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #014980;">)</span><span style="color: #b751b6;">)</span>;
      iswalk<span style="color: #b751b6;">[</span>nx<span style="color: #b751b6;">][</span>ny<span style="color: #b751b6;">]</span> = <span style="color: #383a42;">true</span>;
    <span style="color: #556b2f;">}</span>
  <span style="color: #a626a4;">}</span>

  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; i &lt;= n; i++<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">for</span> <span style="color: #556b2f;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">j</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; j &lt;= m; j++<span style="color: #556b2f;">)</span>
      printf<span style="color: #556b2f;">(</span><span style="color: #8a3b3c;">"%-5d"</span>, board<span style="color: #b751b6;">[</span>i<span style="color: #b751b6;">][</span>j<span style="color: #b751b6;">]</span><span style="color: #556b2f;">)</span>;
    printf<span style="color: #556b2f;">(</span><span style="color: #8a3b3c;">"\n"</span><span style="color: #556b2f;">)</span>;
  <span style="color: #a626a4;">}</span>
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8c0d365" class="outline-2">
<h2 id="org8c0d365">奇怪的电梯</h2>
<div class="outline-text-2" id="text-org8c0d365">
<p>
<a href="https://www.luogu.com.cn/problem/P1135">https://www.luogu.com.cn/problem/P1135</a><br>
</p>
</div>
<div id="outline-container-orgbcfea2d" class="outline-3">
<h3 id="orgbcfea2d">思路</h3>
<div class="outline-text-3" id="text-orgbcfea2d">
<p>
根据题意，一个楼层最多只能跳转到另外两个楼层，一个节点表示一个楼层，画成图就是一个节点连接着两个节点，可以自己尝试的在纸上画一下。<br>
</p>

<p>
那么题目的意思就是在这一张图上找到起点到终点的最短距离，使用 <code>bfs</code> 即可。<br>
</p>
</div>
</div>
